app/controllers/company/businesses_controller.rb

  def show
    @business = @company.businesses.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 980190962 AND (`businesses`.company_id = 7))

  def edit
    @business = @company.businesses.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 980190962 AND (`businesses`.company_id = 7))

  def create

    @business = @company.businesses.build(params[:business])
    respond_to do |format|
      if @business.save
---
INSERT INTO `businesses` (`created_at`, `title`, `updated_at`, `business_image_file_size`, `total`, `business_image_file_name`, `business_image_updated_at`, `company_id`, `business_image_content_type`) VALUES('2011-04-22 17:52:25', 'test', '2011-04-22 17:52:25', NULL, 5, NULL, NULL, 7, NULL)

  def update
    @business = @company.businesses.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 980190962 AND (`businesses`.company_id = 7))

  def destroy
    @business = @company.businesses.find(params[:id])
    @business.destroy
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 980190962 AND (`businesses`.company_id = 7))
DELETE FROM `businesses` WHERE `id` = 980190962

  def buy
    @business = Business.find params[:id]
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 980190962)