app/controllers/company/business_card_controller.rb

UPDATE `layouts` SET `updated_at` = '2011-04-22 17:43:30', `presentation_text` = '123' WHERE `id` = 1
---
  def update
    @company.layout.update_attributes(params[:id]=>params[:value])