app/controllers/company/components_controller.rb

  def edit
    @component = @layout.components.find params[:id]
---
SELECT * FROM `components` WHERE (`components`.`id` = 5099 AND (`components`.layout_id = 241))

  def create
    parameters = params[:component]
    if attachment = get_attachment
      parameters.merge!(:image_attachment=>attachment)
    end
    @component = MAP_TYPE[params[:tipo]].constantize.new(parameters)
    @layout.components << @component
---
INSERT INTO `components` (`created_at`, `title`, `font_colors`, `picture_content_type`, `updated_at`, `show_phone`, `show_all_content`, `url`, `show_name`, `type`, `picture_file_name`, `show_email`, `picture_file_size`, `show_message`, `description`, `layout_id`, `show_address`) VALUES('2011-04-19 01:36:15', 'Galeria louca', NULL, NULL, '2011-04-19 01:36:15', 1, 0, NULL, 1, 'ComponentGallery', NULL, 1, NULL, 1, NULL, 241, 1)

  def update
    parameters = params[:component]
    if attachment = get_attachment
      parameters.merge!(:image_attachment=>attachment)
    end
    @component = @layout.components.find params[:id]
---
SELECT * FROM `components` WHERE (`components`.`id` = 5099 AND (`components`.layout_id = 241))