app/controllers/company/components_controller.rb

  def update
    parameters = params[:component]
    if attachment = get_attachment
      parameters.merge!(:image_attachment=>attachment)
    end
    @component = @layout.components.find params[:id]
    @component.update_attributes!(parameters)
---
UPDATE `components` SET `updated_at` = '2011-04-22 17:43:31', `show_phone` = 1, `title` = 'Entre em contato conosco', `show_address` = 0, `show_message` = 0, `description` = 'null', `url` = 'null' WHERE `id` = 9
UPDATE `layouts` SET `updated_at` = '2011-04-22 17:43:31', `font_colors` = '0xdescri' WHERE `id` = 2