app/controllers/company/layout_controller.rb

  def update_background_top
    path = params[:id].gsub('_small','')
    @layout.update_attribute(:background_top,path)
---
UPDATE `layouts` SET `updated_at` = '2011-04-22 17:43:31', `background_top` = '/image/temp' WHERE `id` = 2

  def update_background
    path = params[:id].gsub('_small','')
    @layout.update_attribute(:background_file_name,path)
---
UPDATE `layouts` SET `updated_at` = '2011-04-22 17:43:31', `background_file_name` = '/image/temp' WHERE `id` = 2