app/controllers/company/messages_controller.rb

  def create
    parameters = params[:message]
    if params[:public_profile]
      parameters = params[:message].merge(:body=>params[:value])
    end
    @message = current_company.sent_messages.build(parameters)
    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`sender_email`, `created_at`, `receiver_email`, `deleted_sent_box`, `receiver_id`, `body`, `first_answer`, `updated_at`, `subject`, `sender_id`, `answer_id`, `sender_name`) VALUES(NULL, '2011-04-22 17:43:31', NULL, NULL, NULL, 'Corpo da mensagem', NULL, '2011-04-22 17:43:31', 'Teste - Mensagem enviada do sistema', 8, NULL, NULL)

  def show
    @folder = current_company.inbox
    @folder ||= current_company.folders.find(params[:id])
    @unread_messages = @folder.messages.find_unread_messages :all
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1)