app/controllers/company/phones_controller.rb

INSERT INTO `phones` (`number`, `created_at`, `updated_at`, `ddd`, `owner_id`, `company_id`, `person_id`, `owner_type`) VALUES(88888888, '2011-04-22 17:43:31', '2011-04-22 17:43:31', 21, 5, NULL, NULL, 'Company')
---
  def create
    @phone = Phone.new params[:phone]
    @company.phones << @phone

SELECT * FROM `phones` WHERE (`phones`.`id` = 980190962 AND (`phones`.owner_id = 5 AND `phones`.owner_type = 'Company'))
DELETE FROM `phones` WHERE `id` = 980190962
---
  def destroy
    @phone = @company.phones.find params[:id]
    @company.phones.delete @phone