app/controllers/company/pictures_controller.rb

  def edit
    @picture = @component.pictures.find params[:id]
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 13553 AND (`pictures`.component_id = 5099 AND `pictures`.component_type = 'Component'))

  def update
    @picture = @component.pictures.find params[:id]
    @picture.update_attributes!((params[:picture] || {} ).merge(:image_attachment=>get_attachment))
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 13553 AND (`pictures`.component_id = 5099 AND `pictures`.component_type = 'Component'))
UPDATE `pictures` SET `updated_at` = '2011-04-22 20:24:10', `photo_file_name` = '100_0013.JPG', `photo_file_size` = 185992 WHERE `id` = 13553

  def load_components
    @component = @layout.components.find params[:component_id]
---
SELECT * FROM `components` WHERE (`components`.`id` = 5099 AND (`components`.layout_id = 241))