app/controllers/company/profile_controller.rb

SELECT * FROM `companies` WHERE (`companies`.user_id = 12) LIMIT 1
---
  def public
    @company = Company.find params[:id]