app/controllers/company/profile_controller.rb

SELECT * FROM `feeds` WHERE (`feeds`.feed_item_id = 5380) LIMIT 1
SELECT `companies`.id FROM `companies` INNER JOIN `company_relationships` ON `companies`.id = `company_relationships`.company_origin_id WHERE ((`company_relationships`.company_destiny_id = 248))
SELECT count(DISTINCT feed_items.id) AS count_distinct_feed_items_id FROM `feed_items` INNER JOIN `feeds` ON feeds.feed_item_id = feed_items.id WHERE (feeds.company_id in (263,271,227,245,321,294,322,283,244,347,436,249,234,439,351,221,301,248) and (is_public = 1 or company_id = 248))
SELECT distinct feed_items.* FROM `feed_items` INNER JOIN `feeds` ON feeds.feed_item_id = feed_items.id WHERE (feeds.company_id in (263,271,227,245,321,294,322,283,244,347,436,249,234,439,351,221,301,248) and (is_public = 1 or company_id = 248)) ORDER BY feed_items.updated_at desc LIMIT 0, 10
---
  def index
    ids = @company.origin_ids + @company.destiny_ids + [@company.id]
    @feed_items = FeedItem.paginate :page=>params[:page],:joins=>:feeds,:per_page=>10,
      :include=>:item, :select=>"distinct feed_items.*",
      :conditions=>["feeds.company_id in (?) and (is_public = ? or company_id = ?)",ids,true,@company.id], :order=>"feed_items.updated_at desc"