app/controllers/company/publish_controller.rb

SELECT * FROM `addresses` WHERE (`addresses`.owner_id = 241 AND `addresses`.owner_type = 'Layout') LIMIT 1
SELECT * FROM `components` WHERE (`components`.layout_id = 241 AND (exists (select * from tab_components as tab_components where tab_components.component_id = components.id) and type in ('ComponentGallery','ComponentText')))
---
  def create
    Dir::mkdir(PATH_SITES) unless File.directory?(PATH_SITES)
    # Incluir verificação de nomes reservados
    # Verifica se já existe a pasta e remove
    site_path = PATH_SITES+current_company.login
    if File.directory?(site_path)
      FileUtils::remove_dir(site_path,true)
      # Recria a pasta
    end
    @user = current_company
    Dir::mkdir(site_path)
    # Recupera os dados da empresa
    # Para cada aba
    @map = get_location(@layout.address_site.to_s)
    File.open site_path +"/show.html","w+" do |f|
      content_map = render_to_string(:template=>"/company/publish/show.html",:layout=>false,:locals=>{:map=>@map})
      f.write content_map
    end
    @layout.tabs_with_components.each do |tab|