app/controllers/company/relationship_request_controller.rb

SELECT * FROM `companies` WHERE (`companies`.user_id = 8) LIMIT 1
INSERT INTO `company_relationships` (`company_origin_id`, `created_at`, `confirmed`, `company_destiny_id`, `updated_at`) VALUES(5, '2011-04-22 17:43:32', 0, 4, '2011-04-22 17:43:32')
---
  def create
    company = Company.find params[:id]
    current = current_company.company
    if current.has_origins? company
      redirect_to :action=>:update,:id=>company.id
    elsif current.has_destinies? company
      flash[:notice] = I18n.t 'company.messages.relationship_initialized'
      respond_to do |format|
        format.js
      end
    else
      company_relationship = CompanyRelationship.create!(:origin=>current,:destiny=>company)

SELECT * FROM `companies` WHERE (`companies`.user_id = 8) LIMIT 1
---
  def destroy
    current = current_company.company
    company = Company.find params[:id]