app/controllers/company/sent_controller.rb

SELECT * FROM `messages` WHERE (`messages`.sender_id = 8 AND (deleted_sent_box = 0 or deleted_sent_box is null)) ORDER BY created_at DESC LIMIT 0, 10
---
  def index
    @messages = current_company.sent_messages.paginate :per_page => 10, :page => params[:page], :order => "created_at DESC"

SELECT * FROM `messages` WHERE (`messages`.`id` = 1 AND (`messages`.sender_id = 8 AND (deleted_sent_box = 0 or deleted_sent_box is null)))
---
  def show
    @message = current_company.sent_messages.find(params[:id])