app/controllers/company/service_controller.rb

  def create
    @service = Service.find params[:id]
    unless @company.services.exists?(@service)
      @company.services << @service
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)
SELECT `services`.id FROM `services` INNER JOIN `company_services` ON `services`.id = `company_services`.service_id WHERE (`services`.`id` = 1) AND ((`company_services`.company_id = 5)) LIMIT 1
INSERT INTO `company_services` (`created_at`, `updated_at`, `service_id`, `company_id`) VALUES('2011-04-22 17:43:32', '2011-04-22 17:43:32', 1, 5)

  def destroy
    @service = Service.find params[:id]
    @company.services.delete(@service)
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)
DELETE FROM `company_services` WHERE (`company_services`.`service_id` = 1 AND `company_services`.`company_id` = 5)