app/controllers/company/tab_components_controller.rb

UPDATE `tab_components` SET `updated_at` = '2011-04-19 01:37:16', `full_line` = 1 WHERE `id` = 11349
---
  def update
    unless @component.tab_component.nil?
      @component.tab_component.update_attribute :full_line, params[:full_line]

SELECT * FROM `components` WHERE (`components`.layout_id = 241 AND (`components`.`id` = '5099')) LIMIT 1
---
  def load_component
    @component = @layout.components.find(:first, :conditions=>{:id=>params[:id]}, :include=>:tab_component)