app/controllers/company/tab_components_controller.rb

DELETE FROM `tab_components` WHERE (`id` IN (148646006))
---
  def create
    unless @component.tab_component.nil?
      TabComponent.delete @component.tab_component.id

DELETE FROM `tab_components` WHERE (`id` IN (148646006))
---
  def destroy
    unless @component.tab_component.nil?
      TabComponent.delete @component.tab_component.id

SELECT * FROM `components` WHERE (`components`.layout_id = 1 AND (`components`.`id` = 5)) LIMIT 1
---
  def load_component
    @component = @layout.components.find(:first, :conditions=>{:id=>params[:id]}, :include=>:tab_component)