app/controllers/company/tabs_controller.rb

INSERT INTO `tabs` (`created_at`, `title`, `updated_at`, `order`, `layout_id`) VALUES('2011-04-22 17:43:32', 'Aba 1', '2011-04-22 17:43:32', NULL, 1)
---
  def create
    @tab = @layout.tabs.create(params[:tab])

SELECT * FROM `tabs` WHERE (`tabs`.`id` = 2 AND (`tabs`.layout_id = 1)) ORDER BY tabs.order
UPDATE `tabs` SET `updated_at` = '2011-04-22 17:43:32', `order` = 1.0 WHERE `id` = 2
---
  def reorder
    order = 1
    params[:tab_ids].each { |id|
      @layout.tabs.find(id).update_attribute(:order,order)

SELECT * FROM `tabs` WHERE (`tabs`.`id` = 1 AND (`tabs`.layout_id = 1)) ORDER BY tabs.order
DELETE FROM `tabs` WHERE `id` = 1
---
  def destroy
    @tab = @layout.tabs.find params[:id]
    @layout.tabs.delete(@tab)