app/controllers/company/users_controller.rb

  def update
    @user = current_company
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2011-04-22 17:43:32', `login` = 'quentin2' WHERE `id` = 12