app/controllers/financial/company_not_payed_controller.rb

SELECT `contracts`.* FROM `contracts` WHERE (`contracts`.company_id = 7) ORDER BY created_at DESC
---
  def show
    @page = params[:page] || 1
    @company = CompanyZ.find :first, :include=>"contracts", :conditions=>{:id=>params[:id]}