app/controllers/financial/main_controller.rb

SELECT count(*) AS count_all FROM `titles` WHERE (`titles`.contract_id = 3)
INSERT INTO `titles` (`fine_percent`, `created_at`, `your_number`, `days_to_charge_fine`, `occurrency_complement`, `abatement_value`, `updated_at`, `discount_type`, `interest_type`, `occurrency`, `error_message`, `value`, `our_number`, `company_id`, `due_date`, `interest_percent`, `emission_date`, `discount_value`, `additional_data`, `discount_limit_date`, `status`, `contract_id`) VALUES(2.0, '2011-04-22 17:31:49', 'SZ20006', 0, NULL, NULL, '2011-04-22 17:31:49', 'Sem desconto', '0', NULL, NULL, 50.0, NULL, 7, '2011-05-22 00:00:00', 0.2, '2011-04-22 14:31:49', NULL, 'Célula Z - serviços de internet\nApós vencimento, cobrar multa de 2%\nJuros ao dia: R$ 0,50 após o vencimento', NULL, 'Digitado', 3)
SELECT `titles`.id FROM `titles` WHERE (`titles`.`due_date` = '2011-05-22 00:00:00' AND `titles`.your_number = 'SZ20006') LIMIT 1
---
  def generate_new_titles
    count = 0
    Contract.find_all_and_no_title(params[:month]).each { |contract|
      if (contract.parcel > contract.titles.count)
        contract.titles.create!(:due_date=> Time.utc(params[:month].to_i < 12 ? Time.now.year : Time.now.year.next,params[:month].to_i  < 12 ? params[:month].to_i.next  : 1,contract.initial_date.day),
          :value=> contract.value,
          :fine_percent=> 2,
          :days_to_charge_fine=> 0,
          :discount_type=> "Sem desconto",
          :your_number=> contract.company.drawee_code,
          :company=>contract.company,
          :emission_date=>Time.now,
          :interest_type=>"0",
          :interest_percent=>0.20,
          :additional_data=>"#{I18n.t "company.site_title"} - serviços de internet\nApós vencimento, cobrar multa de 2%\nJuros ao dia: R$ 0,50 após o vencimento")