app/controllers/financial/send_shipping_controller.rb

SELECT * FROM `shippings` WHERE (`shippings`.`status` = 'Aberto')
---
  def index
    @shippings = Shipping.find :all, :conditions=>{:status=>"Aberto"}

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
---
  def show
    @shipping = Shipping.find params[:id]

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
UPDATE `shippings` SET `updated_at` = '2011-04-22 17:31:50', `processing_date` = '2011-04-22 14:31:50' WHERE `id` = 1
SELECT `shippings`.id FROM `shippings` WHERE (`shippings`.`processing_date` = '2011-04-22 14:31:50' AND `shippings`.id <> 1) LIMIT 1
SELECT `titles`.* FROM `titles` INNER JOIN `shipping_titles` ON `titles`.id = `shipping_titles`.title_id WHERE ((`shipping_titles`.shipping_id = 1))
UPDATE `titles` SET `updated_at` = '2011-04-22 17:31:50', `status` = 'Enviado' WHERE `id` = 4
---
  def create
    @shipping = Shipping.find params[:id]
    Shipping.transaction  do
      @shipping.update_attributes!(:processing_date=> Time.now)
      file = ShippingFile::create_file @shipping
      emails=[]
      emails << UserDirector.find(:first).email
      emails << UserAdministrator.find(:first).email
      ShippingMailer.deliver_send_shipping_file emails,@shipping,file
      @shipping.titles.each { |title|
        title.send!
      }
      @shipping.update_attribute(:file,file)