app/controllers/financial/shippings_controller.rb

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
---
  def show
    @shipping = Shipping.find(params[:id])

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
---
  def edit
    @shipping = Shipping.find(params[:id])

INSERT INTO `shippings` (`created_at`, `code`, `updated_at`, `file_content_type`, `file_data`, `file_name`, `processing_date`, `status`) VALUES('2011-04-22 17:31:50', NULL, '2011-04-22 17:31:50', NULL, NULL, NULL, NULL, 'Aberto')
---
  def create
    @shipping = Shipping.new(params[:shipping])

    respond_to do |format|
      if @shipping.save

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
UPDATE `titles` SET `updated_at` = '2011-04-22 17:31:50', `status` = 'Digitado' WHERE `id` = 4
---
  def update
    @shipping = Shipping.find(params[:id])

    respond_to do |format|
      @titles = @shipping.titles
      if @shipping.update_attributes(params[:shipping])

SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
DELETE FROM `shippings` WHERE `id` = 1
---
  def destroy
    @shipping = Shipping.find(params[:id])
    @shipping.destroy