app/controllers/financial/titles_not_payed_controller.rb

  def index
    @titles = @company.titles_visible.paginate :page=>params[:page],:order=>"created_at desc"
---
SELECT * FROM `titles` WHERE (`titles`.company_id = 5 AND ((status = 'Liquidado' or status <> 'Baixado') and our_number is not null)) ORDER BY created_at desc LIMIT 0, 30

  def show
    @title = @company.titles.find(params[:id])
    @address = @company.address_business_card

    @nosso_numero =  @title.our_number  # Nosso numero - REGRA: Máximo de 13 caracteres!
    @numero_documento =  @title.id	# Num do pedido ou do documento
    @data_vencimento =  @title.due_date.strftime("%d/%m/%Y") # Data de Vencimento do Boleto - REGRA: Formato DD/MM/AAAA
    @data_documento =  Time.now.strftime("%d/%m/%Y") # Data de emissão do Boleto
    @data_processamento =  Time.now.strftime("%d/%m/%Y") # Data de processamento do boleto (opcional)
    @valor_boleto =  @title.value.to_s 	# Valor do Boleto - REGRA: Com vírgula e sempre com duas casas depois da virgula

    # DADOS DO SEU CLIENTE
    @sacado =  @company.cnpj.nil? ? @company.person_name : @company.razao_social
    @endereco1 =  "#{@address.street} #{@address.number} / #{@address.complement} - #{@address.neighborhood}"
    @endereco2 =  "#{@address.city} - #{@address.state} -  CEP: #{@address.zip}"

    data = []
    @title.additional_data.each{|s|data << s.chomp } unless @title.additional_data.nil?
---
SELECT * FROM `titles` WHERE (`titles`.`id` = 1 AND (`titles`.company_id = 5))
SELECT * FROM `addresses` WHERE (`addresses`.owner_id = 5 AND `addresses`.owner_type = 'Company') LIMIT 1


    # ---------------------- DADOS FIXOS DE CONFIGURAÇÃO DO SEU BOLETO --------------- #
    # DADOS DA SUA CONTA - REAL
    @agencia =  Constant.find_value_by_key("agencia_cedente") # Num da agencia, sem digito
---
SELECT * FROM `constants` WHERE (`constants`.`key` = 'agencia_cedente') LIMIT 1