app/controllers/financial/titles_controller.rb

  def index
    page = params[:page] || 1
    @titles = Title.paginate :page=>page,:include => [:company], :order=>"due_date desc"
---
SELECT * FROM `titles` ORDER BY due_date desc LIMIT 0, 30

  def show
    @title = @company.titles.find(params[:id])
---
SELECT * FROM `titles` WHERE (`titles`.`id` = 1 AND (`titles`.company_id = 5))

  def edit
    @title = @company.titles.find(params[:id])
---
SELECT * FROM `titles` WHERE (`titles`.`id` = 1 AND (`titles`.company_id = 5))

  def create
    fix_decimal_numbers(params[:title])
    @title = Title.new(params[:title])

    respond_to do |format|
      if @company.titles << @title
---
INSERT INTO `titles` (`fine_percent`, `created_at`, `your_number`, `days_to_charge_fine`, `occurrency_complement`, `abatement_value`, `updated_at`, `discount_type`, `interest_type`, `occurrency`, `error_message`, `value`, `our_number`, `company_id`, `due_date`, `interest_percent`, `emission_date`, `discount_value`, `additional_data`, `discount_limit_date`, `status`, `contract_id`) VALUES(NULL, '2011-04-22 17:31:50', 'SZ20002', NULL, NULL, NULL, '2011-04-22 17:31:50', 'Sem desconto', NULL, NULL, NULL, 450.0, NULL, 5, '2009-05-05', NULL, '2009-05-01', NULL, NULL, NULL, 'Digitado', 1)

  def update
    @title = @company.titles.find(params[:id])
---
SELECT * FROM `titles` WHERE (`titles`.`id` = 1 AND (`titles`.company_id = 5))

  def destroy
    @title = @company.titles.find(params[:id])
    Title.destroy(@title)
---
SELECT * FROM `titles` WHERE (`titles`.`id` = 1 AND (`titles`.company_id = 5))
DELETE FROM `titles` WHERE `id` = 1

  def find_company
    @company_id = params[:company_id]
    unless @company_id
      flash[:notice]=I18n.t "company.messages.not_found"
      return(redirect_to(:controller=>"/company_management"))
    end
    @company = Company.find(@company_id)
    flash[:notice] = "Para criar um título, cadastre primeiro um contrato novo." if @company.open_contracts.empty?
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
SELECT * FROM `contracts` WHERE (`contracts`.company_id = 5 AND (status='Aberto')) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `contracts` WHERE (`contracts`.company_id = 5 AND (status='Aberto'))