app/controllers/businesses_controller.rb

SELECT * FROM `businesses` LIMIT 0, 30
---
  def index
    @businesses = Business.paginate(:page=>(params[:page]||1))

SELECT * FROM `businesses` WHERE (`businesses`.`id` = 4)
---
  def show
    @business = Business.find(params[:id])