app/controllers/company_management_controller.rb

SELECT * FROM `companies` WHERE (`companies`.user_id = 296) LIMIT 1
---
  def show
    id = params[:id]
    unless @user = UserCompany.find(:first,:conditions=>{:id=>id})

SELECT * FROM `companies` WHERE (`companies`.`id` = 213)
---
  def edit
    @company = Company.find(params[:id])

SELECT * FROM `companies` WHERE (`companies`.user_id = 330) LIMIT 1
SELECT count(*) AS count_all FROM `companies` WHERE (`companies`.`id` = 240)
---
  def loggin_as_company
    user = UserCompany.find_by_id(params[:id])