app/controllers/company_seller_controller.rb

  def new
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 213)