app/controllers/company_management_controller.rb

SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
---
  def update
    @company = Company.find(params[:id])

SELECT * FROM `companies` WHERE (`companies`.user_id = 12) LIMIT 1
---
  def change_type_to_s
    @company = Company.find params[:id]

SELECT * FROM `companies` WHERE (`companies`.user_id = 7) LIMIT 1
UPDATE `companies` SET `updated_at` = '2011-04-22 17:32:05', `register_number` = 'TESTESTESTES', `type` = 'CompanyZ' WHERE `id` = 4
---
  def change_type_to_z
    @company = Company.find params[:id]
    @company.attributes = params[:company]
    @person = @company.person
    @person.attributes = params[:person]
    @user = @company.user
    Company.transaction do
      @company.to_company_z
      @person.save!