app/controllers/company_to_friend_controller.rb

  def create
    company = Company.find(params[:company_id])
    #if params[:email_to].nil?
    #  send_failed "Todos os campos são obrigatórios"
    #elsif (params[:email_to] =~ /\w[-.\w]*\@[-\w]+[-.\w]*\.\w+/).nil?
    #send_failed "O email deve ser válido."
    #else
    CompanyMailer.delay.deliver_new_send_to_friend(params[:email_to], company)
    layout = company.layout
    layout.increment_send_to_friend!
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
UPDATE `layouts` SET `updated_at` = '2011-04-22 17:32:18', `send_to_friend` = 1 WHERE `id` = 1