app/controllers/company_seller_controller.rb

  def create
    @company = Company.find(params[:id])
    seller = Person.find_by_id params[:company][:person_id]
    @company.seller = seller
    company_user = @company.user
    company_person = company_user.person
    company_person.web_adm = seller.web_adm
    User.transaction do
      company_person.save!
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 3)
UPDATE `companies` SET `updated_at` = '2011-04-22 17:33:26', `person_id` = 1 WHERE `id` = 3

  def destroy
    company = Company.find(params[:id])
    company.seller = nil
    company.save
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
UPDATE `companies` SET `updated_at` = '2011-04-22 17:33:26', `person_id` = NULL WHERE `id` = 5