app/controllers/contracts_controller.rb

SELECT * FROM `contracts` WHERE (`contracts`.company_id = 4) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `contracts` WHERE (`contracts`.company_id = 4)
---
  def index
    @contracts = @company.contracts
    if @contracts.empty?

SELECT * FROM `contracts` WHERE (`contracts`.`id` = 1 AND (`contracts`.company_id = 4)) ORDER BY created_at DESC
---
  def show
    @contract = @company.contracts.find(params[:id])

SELECT * FROM `contracts` WHERE (`contracts`.`id` = 1 AND (`contracts`.company_id = 4)) ORDER BY created_at DESC
---
  def edit
    @contract = @company.contracts.find(params[:id])

INSERT INTO `contracts` (`parcel`, `created_at`, `initial_date`, `updated_at`, `value`, `company_id`, `end_date`, `status`) VALUES(12, '2011-04-22 17:31:48', '2008-02-12', '2011-04-22 17:31:48', 50.0, 4, '2009-02-12', 'Aberto')
---
  def create
    @contract = Contract.new(params[:contract])

    respond_to do |format|
      if @company.contracts << @contract

SELECT * FROM `contracts` WHERE (`contracts`.`id` = 1 AND (`contracts`.company_id = 4)) ORDER BY created_at DESC
---
  def update
    @contract = @company.contracts.find(params[:id])

SELECT * FROM `contracts` WHERE (`contracts`.`id` = 4 AND (`contracts`.company_id = 4)) ORDER BY created_at DESC
DELETE FROM `contracts` WHERE `id` = 4
---
  def destroy
    @contract = @company.contracts.find(params[:id])
    Contract.destroy @contract

SELECT * FROM `companies` WHERE (`companies`.`id` = 4)
---
  def find_company
    @company_id = params[:company_id]
    unless @company_id
      flash[:notice]=I18n.t "company.messages.not_found"
      return(redirect_to(:controller=>:company_management))
    end
    @company = Company.find(@company_id)