app/controllers/domains_controller.rb

SELECT * FROM `companies` WHERE (`companies`.user_id = 410) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-05-18 19:11:20', `domain` = 'projetvidros.com.br;projectvidros.com.br' WHERE `id` = 294
---
  def update
    if user = UserCompany.find(params[:id])
      user.update_attributes(:domain=> params[:value])