app/controllers/messages_controller.rb

  def create
    parameters = params[:message]
    if params[:public_profile]
      name      = "Nome: " + (params[:public_profile][:name].blank? ? "" : params[:public_profile][:name])
      address   = "Endereço:" + (params[:public_profile][:address].blank? ? "" : params[:public_profile][:address])
      phone     = "Telefone: " + (params[:public_profile][:ddd].blank? ? "" : params[:public_profile][:ddd] )
      phone     = phone + (params[:public_profile][:number].blank? ? "" : params[:public_profile][:number] )
      new_body  =  name + "<br />" + address + "<br />" + phone + "<br />" + params[:message][:body]
      params[:message][:body] = new_body
    end
    @message = logged_in? ? current_user.sent_messages.build(parameters) : Message.new(parameters)
      if @message.save
---
INSERT INTO `messages` (`sender_email`, `created_at`, `receiver_email`, `deleted_sent_box`, `receiver_id`, `body`, `first_answer`, `updated_at`, `subject`, `sender_id`, `answer_id`, `sender_name`) VALUES('tester@gmail.com', '2011-04-22 17:31:51', NULL, NULL, NULL, 'Corpo da mensagem', NULL, '2011-04-22 17:31:51', 'Teste - Mensagem enviada do business card', NULL, NULL, NULL)