app/controllers/passwords_controller.rb

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'contact@felipepavao.com' AND `users`.id <> 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-05-18 17:58:07', `password_reset_code` = 'fbf89858964261b9f547b21997670ee1bbfe5e7a' WHERE `id` = 1
---
  def create
    redirect_to(root_path) and return unless request.post?
    if @user = User.find_for_forget(params[:email])
      @user.forgot_password
      @user.save