app/controllers/people_controller.rb

  def destroy
    @person = Person.find(params[:id])
    @person.destroy if @person.users.empty?
---
SELECT `users`.* FROM `users` INNER JOIN `user_people` ON `users`.id = `user_people`.user_id WHERE ((`user_people`.person_id = 13))
SELECT count(*) AS count_all FROM `users` INNER JOIN `user_people` ON `users`.id = `user_people`.user_id WHERE ((`user_people`.person_id = 13))