app/controllers/person_phone_controller.rb

  def create
    @person = Person.find params[:id]
    @phone = Phone.new params[:phone]
    @phone.person = @person
    render :update do |page|
      if @phone.save
---
INSERT INTO `phones` (`number`, `created_at`, `updated_at`, `ddd`, `owner_id`, `company_id`, `person_id`, `owner_type`) VALUES(12345678, '2011-04-22 17:31:52', '2011-04-22 17:31:52', 17, NULL, NULL, 8, NULL)

  def destroy
    Phone.destroy(params[:id])
---
DELETE FROM `phones` WHERE `id` = 298486374