app/controllers/resend_activation_mail_controller.rb

SELECT * FROM `users` WHERE (email='quentin@example.com' and activated_at is null) LIMIT 1
---
  def create
     if @user = User.find(:first, :conditions=>["email=? and activated_at is null",params[:email]])