app/controllers/subsidiaries_controller.rb

  def show
    @subsidiary = Subsidiary.find(params[:id])
---
SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 1)

  def edit
    @subsidiary = Subsidiary.find(params[:id])
---
SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 1)

  def change_range
    @subsidiary = Subsidiary.find(params[:id])
    state = State.find(params[:state])
    if @subsidiary.states.include?(state)
      @subsidiary.states.delete(state)
    else
      @subsidiary.states << state
---
SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 1)
SELECT * FROM `states` WHERE (`states`.`id` = 21)
SELECT `states`.id FROM `states` INNER JOIN `subsidiary_states` ON `states`.id = `subsidiary_states`.state_id WHERE (`states`.`id` = 21) AND ((`subsidiary_states`.subsidiary_id = 1)) LIMIT 1
DELETE FROM `subsidiary_states` WHERE (`subsidiary_states`.`subsidiary_id` = 1 AND `subsidiary_states`.`state_id` = 19)
INSERT INTO `subsidiary_states` (`created_at`, `updated_at`, `subsidiary_id`, `state_id`) VALUES('2011-04-22 17:31:52', '2011-04-22 17:31:52', 1, 21)

  def create
    @subsidiary = Subsidiary.new(params[:subsidiary])

    respond_to do |format|
      if @subsidiary.save
---
INSERT INTO `subsidiaries` (`created_at`, `title`, `updated_at`, `enabled`) VALUES('2011-04-22 17:31:52', 'teste', '2011-04-22 17:31:52', 1)

  def update
    @subsidiary = Subsidiary.find(params[:id])

    respond_to do |format|
      if @subsidiary.update_attributes(params[:subsidiary])
---
SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 1)
UPDATE `subsidiaries` SET `updated_at` = '2011-04-22 17:31:53', `title` = '123' WHERE `id` = 1

  def destroy
    @subsidiary = Subsidiary.find(params[:id])
    unless @subsidiary.people.empty?
      flash[:error]="Exclusão negada. A filial possui usuários."
    else
      @subsidiary.destroy
---
SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 3)
SELECT count(*) AS count_all FROM `people` WHERE (`people`.subsidiary_id = 3)
DELETE FROM `subsidiaries` WHERE `id` = 3