app/controllers/template_texts_controller.rb

SELECT * FROM `template_texts` WHERE (`template_texts`.`id` = 980190962)
---
  def show
    @template_text = TemplateText.find(params[:id])

SELECT * FROM `template_texts` WHERE (`template_texts`.`id` = 980190962)
---
  def edit
    @template_text = TemplateText.find(params[:id])

INSERT INTO `template_texts` (`created_at`, `title`, `updated_at`, `content`) VALUES('2011-04-22 17:31:53', 'dadsas', '2011-04-22 17:31:53', 'fsdcsd')
---
  def create
    @template_text = TemplateText.new(params[:template_text])

    respond_to do |format|
      if @template_text.save

SELECT * FROM `template_texts` WHERE (`template_texts`.`id` = 980190962)
UPDATE `template_texts` SET `content` = 'fsdcsd', `updated_at` = '2011-04-22 17:31:53', `title` = 'dadsas' WHERE `id` = 980190962
---
  def update
    @template_text = TemplateText.find(params[:id])

    respond_to do |format|
      if @template_text.update_attributes(params[:template_text])

SELECT * FROM `template_texts` WHERE (`template_texts`.`id` = 980190962)
DELETE FROM `template_texts` WHERE `id` = 980190962
---
  def destroy
    @template_text = TemplateText.find(params[:id])
    @template_text.destroy