app/controllers/template_texts_controller.rb

SELECT * FROM `template_texts`
---
  def index
    @template_texts = TemplateText.all