app/controllers/users_controller.rb

SELECT * FROM `companies` ORDER BY razao_social
---
  def new
    @user = User.new
    @person = Person.new
    @company = Company.new
    @company.address_business_card = Address.new
    @user.company = @company
    @user_type = UserCompany.name
    @company_type = CompanyS.name
    @user_type=params[:type] || current_user.subusers.first

SELECT * FROM `companies` WHERE (`companies`.user_id = 8) LIMIT 1
UPDATE `companies` SET `updated_at` = '2011-04-22 17:31:54', `person_id` = 8 WHERE `id` = 5
---
  def create_page_2
    @user = UserCompany.find params[:id]
    User.transaction do
      @user.person.update_attributes!(params[:person])

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) AND ( (`users`.`type` = 'UserCompany' ) ) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-04-22 17:31:58', `login` = 'quentin2' WHERE `id` = 1
---
  def update
    @user = User.find(current_company || current_user)
    @person = @user.person
    if @user.update_attributes(params[:user])# && @person.update_attributes(params[:person])

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
DELETE FROM `users` WHERE `id` = 13
---
  def destroy
    @user = User.find params[:id]
    if !@user.active? || (current_user.is_director? || current_user.is_administrator?)
      UserMailer.delay.deliver_destroy(@user.login,current_user.login)
      User.destroy(@user.id)

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def resend_signup_mail
    @user = User.find params[:id]