app/controllers/visit_scheduler_controller.rb

SELECT * FROM `subsidiaries` WHERE (`subsidiaries`.`id` = 1)
SELECT * FROM `segments` WHERE (`segments`.`id` = 1)
---
  def create
    @visit_schedule = VisitSchedule.new params[:visit_schedule]
    if @visit_schedule.valid?
      subsidiary = Subsidiary.find @visit_schedule.subsidiary_id
      segment = Segment.find @visit_schedule.segment_id