app/controllers/z_controller.rb

SELECT * FROM `tab_components` WHERE (`tab_components`.tab_id = 755) ORDER BY tab_components.line, tab_components.column
---
  def index
    @user = @company.user
    @layout = @company.layout
    @color = @layout.color
    @tab = @layout.tabs_with_components.find_by_id(params[:tab_id]) || @layout.tabs_with_components.first